{
    "purpose": {
        "name": "Purpose First Group LLC",
        "location": "Houston, TX",
        "date": "December 2017",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its first investment in Purpose First Group, LLC ('PFG'), which closed in December 2017. PFG provides mill-work, cabinets, windows and countertops to multi-family, single-family and commercial markets within the states of Texas and Florida. PFG’s Texas operations are conducted through its wholly-owned subsidiary, Builder’s Choice, Inc, which is the largest family-run building supply distributor for home builders in the Houston area.",
            "Assurance provided financing for PFG to enter into a 50/50 joint venture with Florida-based TMD Windows & Doors and S&S Craftsmen. This joint venture allows PFG to enter the rapidly-growing Florida market and will also bring custom mill-work and cabinet manufacturing capabilities to its current customers."
        ],
        "website": "https://bldrschoice.com/"
    },
    "oldmill": {
        "name": "Old Mill Brick",
        "location": "Salt Lake City, UT",
        "date": "February 2018",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Old Mill Brick, LLC. (“OMB”), which closed in February 2018. Assurance partnered with Bridger Capital Partners who sponsored the transaction. Bridger Capital Partners is a middle market private equity firm focused on founder-led and/or family-owned companies with no prior institutional capital investments.",
            "Founded in 2007, Old Mill Brick owns and distributes several patented, easy to install, thin brick panel systems that can be used with any thin brick, including tumbled and cast. The company’s flagship products called “BrickWeb” and “Colonial” are sold through major retail home improvement stores across North America. The company’s thin brick systems used for both residential and commercial building applications.",
            "Assurance provided both mezzanine debt and equity in support of Bridger’s acquisition of OMB"
        ],
        "website": "https://www.oldmillbrick.com/"
    },
    "apogee": {
        "name": "Apogee Healthcare Holdings LLC",
        "location": "San Angelo, TX",
        "date": "May 2018",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Apogee Healthcare Holdings LLC (the 'Company'), which closed in May 2018. The Company includes two healthcare staffing businesses: Critical Health Connection, LLC (“Critical Health”) and Quincy MD, LLC (dba “HealthPro”). Assurance partnered with Apogee Equity Partners (“Apogee”) who sponsored the transaction. Apogee is a Washington DC-based independent sponsor with a focus on healthcare staffing businesses.",
            "Established in 2002 and based in San Angelo, TX, Critical Health provides per diem nurse staffing services to primarily state-owned and underserved healthcare facilities throughout rural Texas. HealthPro, based in Sherman Oaks, CA, is a medical staffing company serving the prison and other healthcare systems primarily in southern California.",
            "Assurance provided mezzanine financing in support of Apogee's acquisition."
        ],
        "website": "http://www.chcmedstaff.com/"
    },
    "entia": {
        "name": "Entia, LLC",
        "location": "Lake Mary, FL",
        "date": "June 2018",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Entia, LLC (“Entia” or the 'Company'), which closed in early June 2018. Based in Lake Mary, Florida, the Company actively manages a closely held portfolio of businesses spanning multiple sectors, including sensors technology, software, electronic instruments, security and defense, energy services, medical devices, telecommunications and industrials. Entia has grown companies from idea to middle-market transactions in these sectors through the application of their unique management and technical skill set, proprietary technology, and intellectual property.",
            "Assurance provided mezzanine financing in support of the working capital needs and expansion efforts of Entia’s portfolio companies."
        ],
        "website": "http://entiaventures.com/"
    },
    "turtle": {
        "name": "Turtle Southeast, LLC",
        "location": "Largo, FL",
        "date": "June 2018",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Largo, FL-based Turtle Southeast, LLC (“Turtle”). Assurance partnered with Canopy Capital Partners, which led a majority recapitalization of Turtle in mid-June 2018.",
            "Founded in 1974 by the Ando Family, Turtle is a leading provider of asphalt milling services for both prime contractors and government agencies serving the maintenance, repair and construction of Florida’s roadways.",
            "Assurance provided a combination of debt and equity in support of the transaction, the proceeds of which will help Turtle take advantage of numerous growth opportunities in the Roadway Infrastructure Services industry, ranging from add-on acquisitions to investments in new equipment and new services."
        ],
        "website": "http://www.turtlesoutheast.com/"
    },
    "ltech": {
        "name": "L Tech Network Services, Inc.",
        "location": "Satna Fe Springs, CA",
        "date": "May 2019",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) Is pleased to announce its latest investment in Santa Fe Springs, CA-based L Tech Network Services, Inc. (“L Tech”).  Assurance partnered with the sponsor (JK Holdings, LLC) in order to provide mezzanine financing for the acquisition of L Tech.",
            "For the past 25 years, L Tech Network Services, Inc. (“L Tech”) has been a premier installation specialist of all types of low voltage cables including copper, fiber optic and coaxial. L Tech also provides AutoCAD-updated floor plans showing cable pathways, termination points and other relevant information along with complete testing reports for each cable/strand. Assurance partnered with the sponsors (JK Holdings, LLC.) in connection with the acquisition of L Tech."
        ],
        "website": "http://www.ltechnet.com/"
    },
    "millennium": {
        "name": "Millennium Services of Florida",
        "location": "Winter Garden, FL",
        "date": "June 2019",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Winter Garden, FL-Based Millennium Grounds and Waters, LLC (“MGW”). Assurance provided debt financing for the acquisition of MGW.",
            "Founded in 1997, MGW provides comprehensive commercial grounds maintenance services to clients throughout Central Florida comprising of landscape maintenance, design and installation, irrigation installation and servicing, as well as maintenance of traffic projects. Typical customers include office / industrial parks, multi-family communities, hotels, and condo / HOA’s."    
        ],
        "website": "http://www.millenniumservicesfl.com/"
    },
    "webster": {
        "name": "Webster Electric Co., Inc.",
        "location": "Collinsville, MS",
        "date": "June 2019",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Collinsville, MS-based Webster Electric Co., Inc., and Webco Leasing & Supply, LLC (“Webster”).  Assurance partnered with Robert Manner’s private equity group, Providence Group, L.P. to provide capital to Webster Holding Group, LLC, a newly formed entity which acquired Webster.",
            "Webster is an electrical contracting company headquartered in Collinsville, Mississippi. The company installs and maintains industrial, electrical and communications systems for highways, airports, government buildings, bridge upgrades, infrastructure upgrades, and maintenance related work. Much of this work involves Intelligent Transportation System (“ITS”) installations and upgrades, such as Automated Weather Observing Systems (“AWOS”), Automated Surface Observing Systems (“ASOS”), speed monitoring systems, fiber-optics upgrades, weigh-in-motion stations, communications towers, centrally controlled hurricane evacuation routes, and high performance “smart” communications capabilities with government transportation centers. The Company also installs state of the art security/monitoring systems for government-related authorities.",
            "Assurance provided mezzanine debt in support of Providence Group, L.P.’s acquisition of Webster."
        ],
        "website": "http://www.webster-electric.com/"
    },
    "tebco": {
        "name": "The E3 Company",
        "location": "Kilgore, TX",
        "date": "October 2019",
        "desc": ["Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in The E3 Company, LLC (“E3” or the “Company”). Assurance provided mezzanine financing to support BlueWater Equity Partners, LLC, in its acquisition of a controlling interest in the Company.E3  designs and manufactures automated safety systems for customers engaged in the hydraulic fracturing process throughout the oil & gas industry. Its flagship product, the Safety RAT (Relief Automation Technology), as well as the newly designed BAT (Blowdown Automation Technology), help prevent and provide relief for over-pressure events. Utilization of these proprietary products allows drilling companies to ensure the safety of their frac-site personnel and reduce potential damage to high-value wellhead and drilling equipment."],
        "website": "http://www.te3co.com/"
    },
    "pawz": {
        "name": "Pawz, Inc.",
        "location": "Canton, OH",
        "date": "November 2019",
        "desc": [
            "Assurance Mezzanine Fund (“Assurance”) is pleased to announce its latest investment in Canton, Ohio based Pawz, Inc. (“Pawz”). Assurance provided mezzanine debt in support of Sancus Capital Group’s acquisition of 100% of the assets of Pawz",
            "Pawz is an E-commerce company that produces unique apparel, merchandise, jewelry, and other dog-themed products to dog lovers. The Company has a strong brand anchored by its over 2.5 million social media followers. As part of the Company’s philanthropic mission, Pawz donates 10% of profits to no-kill dog shelters."
        ],
        "website": "http://www.pawz.com/"
    }
}